Repository: sapy22/huawei_manager_py
Catalog: src/resources/locale/*/LC_MESSAGES/messages.po
Languages: ar_sa

source: Settings
ar_sa: الإعدادات

source: About
ar_sa: حول البرنامج

source: Signal
ar_sa: الإشارة

source: Band Select
ar_sa: اختيار النطاق

source: SMS
ar_sa: الرسائل النصية

source: Advance
ar_sa: متقدم

source: Get
ar_sa: معلومات

source: Set
ar_sa: الضبط

source: Internet connection will reset. Continue?
ar_sa: سيتم إعادة تعيين الاتصال بالإنترنت. هل ترغب في المتابعة؟

source: Name
ar_sa: الاسم

source: Value
ar_sa: القيمة

source: Exit
ar_sa: خروج

source: The device will shutdown. Continue??
ar_sa: سيتم إيقاف تشغيل الجهاز. هل ترغب في المتابعة؟

source: The device will restart. Continue?
ar_sa: سيتم إعادة تشغيل الجهاز. هل ترغب في المتابعة؟

source: All configurations will be restored to factory settings. Continue?
ar_sa: سيتم استعادة إعدادات المصنع. هل ترغب في المتابعة؟

source: Apply dns settings. Continue?
ar_sa: تطبيق الإعدادات. هل ترغب في المتابعة؟

source: Reset dns settings. Continue?
ar_sa: إعادة تعيين الإعدادات. هل ترغب في المتابعة؟

source: Power
ar_sa: الطاقة

source: ShutDown
ar_sa: إيقاف التشغيل

source: Restart
ar_sa: إعادة التشغيل

source: Reset
ar_sa: إعادة الضبط

source: IP
ar_sa: عنوان الآي بي

source: Primary
ar_sa: أساسي

source: Secondary
ar_sa: ثانوي

source: Apply
ar_sa: تطبيق

source: Apply band settings. Continue?
ar_sa: تطبيق إعدادات النطاق. هل ترغب في المتابعة؟

source: Choose at least one lte band!
ar_sa: اختر نطاق واحد على الأقل

source: Network Mode
ar_sa: وضع الشبكة

source: Network Band
ar_sa: نطاق الشبكة

source: LTE band
ar_sa: LTE نطاق

source: LTE Band
ar_sa: LTE نطاق

source: Manual
ar_sa: يدوي

source: Band Hint
ar_sa: تلميح النطاقات

source: None
ar_sa: بدون

source: STC
ar_sa: الاتصالات السعودية

source: Mobily
ar_sa: موبايلي

source: Zain
ar_sa: زين

source: Clear
ar_sa: مسح

source: Connection
ar_sa: الاتصال

source: Language
ar_sa: اللغة

source: UI
ar_sa: واجهة المستخدم

source: Save
ar_sa: حفظ

source: USER
ar_sa: اسم المستخدم

source: PASSWORD
ar_sa: كلمة المرور

source: Show Pass
ar_sa: إظهار كلمة المرور

source: Keep Connection
ar_sa: البقاء متصل

source: Auto login after 5min
ar_sa: تسجيل الدخول بشكل تلقائي بعد مرور ٥ دقائق

source: English
ar_sa: الإنجليزية

source: Arabic
ar_sa: العربية

source: Layout Direction
ar_sa: اتجاه التخطيط

source: Left to Right
ar_sa: اليسار إلى اليمين

source: Right to Left
ar_sa: اليمين إلى اليسار

source: Mode
ar_sa: الوضع

source: NR-5G
ar_sa: 5G إشارة

source: Graph
ar_sa: الرسوم البيانية

source: RSRQ
ar_sa: جودة الإشارة

source: RSRP
ar_sa: قوة الإشارة

source: SINR
ar_sa: إشارة / تشويش

source: Download & Upload
ar_sa: سرعة التنزيل و الرفع

source: login required
ar_sa: يجب تسجيل الدخول

source: Monitor
ar_sa: مراقبة

source: Statistics
ar_sa: الإحصاءات

source: start
ar_sa: ابدأ

source: stop
ar_sa: توقف

source: connecting
ar_sa: جار الاتصال

source: connected
ar_sa: متصل

source: disconnected
ar_sa: غير متصل

source: no connection
ar_sa: لا يوجد اتصال

source: connection error
ar_sa: خطأ في الاتصال

source: restricted
ar_sa: غير متصل

source: unrestricted
ar_sa: متصل

source: Network
ar_sa: الشبكة

source: FullName
ar_sa: مزود الخدمة

source: LTE 4G
ar_sa: 4G إشارة

source: rsrq
ar_sa: جودة الإشارة

source: signal qualty
ar_sa: جودة الإشارة

source: -20 to 0, lower is better
ar_sa: من -٢٠ إلى ٠، الأقل هو الأفضل

source: rsrp
ar_sa: قوة الإشارة

source: signal power
ar_sa: قوة الإشارة

source: -90 to -70, lower is better
ar_sa: من -٩٠ إلى -٧٠، الأقل هو الأفضل

source: sinr
ar_sa: إشارة / تشويش

source: signal to noise ratio
ar_sa: نسبة الإشارة الى التشويش

source: 0 to 20, higher is better
ar_sa: من ٠ إلى ٢٠، الأعلى هو الأفضل

source: txpower
ar_sa: طاقة الإرسال

source: band
ar_sa: النطاق

source: dlbandwidth
ar_sa: عرض النطاق

source: rssi
ar_sa: معدل الإشارة

source: NR 5G
ar_sa: 5G إشارة

source: nrrsrq
ar_sa: جودة الإشارة

source: nrrsrp
ar_sa: قوة الإشارة

source: nrsinr
ar_sa: إشارة / تشويش

source: nrtxpower
ar_sa: طاقة الإرسال

source: nrband
ar_sa: النطاق

source: nrdlbandwidth
ar_sa: عرض النطاق

source: mode
ar_sa: المود

source: LTE Tower
ar_sa: معلومات البرج

source: pci
ar_sa: البرج

source: cid
ar_sa: السكتور

source: Connection and Endc
ar_sa: الاتصال و الاتصال الثنائي

source: connectionstatus
ar_sa: حالة الاتصال

source: endcstatus
ar_sa: حالة الاتصال الثنائي

source: SignalIcon
ar_sa: 4G تغطية

source: SignalIconNr
ar_sa: 5G تغطية

source: CurrentNetworkType
ar_sa: نوع الشبكة

source: CurrentNetworkTypeEx
ar_sa: نوع الشبكة 2

source: CurrentDownload
ar_sa: التنزيل الحالي

source: CurrentUpload
ar_sa: الرفع الحالي

source: CurrentConnectTime
ar_sa: مدة الاتصال الحالي

source: TotalDownload
ar_sa: إجمالي التنزيل

source: TotalUpload
ar_sa: إجمالي الرفع

source: TotalConnectTime
ar_sa: إجمالي مدة الاتصال

source: CurrentDownloadRate
ar_sa: سرعة التنزيل

source: CurrentUploadRate
ar_sa: سرعة الرفع

source: Send SMS. Continue?
ar_sa: إرسال رسالة نصية. هل ترغب في المتابعة؟

source: The Number\s or Message is empty!
ar_sa: حقل الرقم او الرسالة فارغ

source: Message length cannot exceed 160 characters!
ar_sa: طول الرسالة لا يمكن أن يتجاوز 160 حرفًا

source: New SMS
ar_sa: رسالة جديدة

source: Inbox
ar_sa: صندوق الوارد

source: Outbox
ar_sa: صندوق الصادر

source: Contacts
ar_sa: جهات الاتصال

source: Content
ar_sa: المحتوى

source: Date
ar_sa: التاريخ

source: use ; to separate more than one number
ar_sa: استخدم ; لفصل أكثر من رقم

source: Number\s
ar_sa: الأرقام

source: Send
ar_sa: إرسال

source: IP or User or Password is empty!
ar_sa: عنوان الآي بي أو اسم المستخدم أو كلمة المرور فارغة

source: Username or Password is wrong!
ar_sa: اسم المستخدم أو كلمة المرور غير صحيحة

source: Password is overrun wait a few minutes.
ar_sa: تم تجاوز حد إدخال كلمة المرور. الرجاء المحاولة بعد بضع دقائق

source: Request timed out while trying to connect.
ar_sa: انتهت مهلة الطلب أثناء محاولة الاتصال

source: Connect Error!
ar_sa: خطأ في الاتصال"

source: Error
ar_sa: خطأ

source: Info
ar_sa: معلومة

source: Response
ar_sa: الرد

source: Confirm
ar_sa: تأكيد

source: Settings file does not exist!
ar_sa: ملف الإعدادات غير موجود

source: Settings file invalid!
ar_sa: ملف الإعدادات غير صالح

source: Settings file error!
ar_sa: خطأ في ملف الإعدادات

source: Connection settings invalid!
ar_sa: إعدادات الاتصال غير صالحة

source: Language settings invalid!
ar_sa: إعدادات اللغة غير صالحة

source: UI settings invalid!
ar_sa: إعدادات واجهة المستخدم غير صالحة
